<?php
if(!defined('GAME')) {
	die();
}
//для пацанов
$comment_array_1 = array ('Что поговорить больше не с кем?','Так слово за слова и получил Иванушка инвалидность...','Отдыхай!','Вас много, комментатор - один!','А станете наезжать, не буду комментировать ваши бои!','Отвали!','Тренируйся на кошечках!','Анекдот: - Товарищ водитель, почему ваша пассажирка не пристегнута ремнями безопасности? - Так это же моя тёща!!','Сам такой!','Продам кредиты (в приват)','мдя...','Лучше в бою проявляй энтузиазм.','Кто тут комментатор? Ты или я???','Надо же...','Сам дурак!','Наши комментаторы, самые <вырезано цензурой> комментаторские комментаторы в мире!','(судорожно оглядываясь) КТО ЗДЕСЬ???','Не болтайте ерундой','Все! Теперь ты мне должен!','р-р-р...','А в бою это повторить сможешь?','Я долго думал, что такое 90х60х90. Оказалось, что это 486 000.','Может тебе кредитов дать, чтоб отстал?','Братву позову!','Твой интеллект поражает <вырезано цензурой>','Вот сижу тут и разбавляю свою мудрость вашей глупостью.','Ты с кем посоревноваться решил?','Ждите ответа. Ждите ответа. Ждите ответа. Ждите ответа. Ждите, короче...','Я комментатор! А ты кто???',
'Щас я все это запишу, а потом передам кляузу паладинам...','я занят!!!');
//для подруг
$comment_array_2 = array ('Что поговорить больше не с кем?','Так слово за слова и получил Иванушка инвалидность...','Отдыхай!','Вас много, комментатор - один!','А станете наезжать, не буду комментировать ваши бои!','Отвали!','Тренируйся на кошечках!','Анекдот: - Товарищ водитель, почему ваша пассажирка не пристегнута ремнями безопасности? - Так это же моя тёща!!','Сама такая!','Продам кредиты (в приват)','мдя...','Лучше в бою проявляй энтузиазм.','Кто тут комментатор? Ты или я???','Надо же...','Сама такая!','Наши комментаторы, самые <вырезано цензурой> комментаторские комментаторы в мире!','(судорожно оглядываясь) КТО ЗДЕСЬ???','Не болтайте ерундой','Все! Теперь ты мне должна!','р-р-р...','А в бою это повторить сможешь?','Я долго думал, что такое 90х60х90. Оказалось, что это 486 000.','Может тебе кредитов дать, чтоб отстала?','Братву позову!','Твой интеллект поражает <вырезано цензурой>','Вот сижу тут и разбавляю свою мудрость вашей глупостью.','Ты с кем посоревноваться решила?','Ждите ответа. Ждите ответа. Ждите ответа. Ждите ответа. Ждите, короче...','Я комментатор! А ты кто???','Щас я все это запишу, а потом передам кляузу паладинам...','я занят!!!');

//молчанка в чате
$comment_array_3 = array ('У вас есть право хранить молчание','Бог сотворил землю, а паладин молчание!!!','Сначала было слово. Потом появилось молчание...','Жестоко, но справедливо','Я вас долго слушал, теперь у вас есть время подумать.','Ни ругнуться, ни ответить теперь.','В Клубе жесткие законы... Только не надо тосковать по беззаконью!','О чем с этим человеком можно говорить, когда с ним и помолчать то не о чем!','Молчание - золото','Безобразие куда цензура смотрит?','А еще раз можешь? ;)','Я конечно не садист, но мне все это нравится','Это урок нам всем','Нет крика громче тишины...','А раньше все не так было','Семь раз подумай, один раз промолчи.','Тебе повезло, что не навсегда.','Молчание не ценят, потому что оно достается на халяву... (с), но ему подарю с удовольствием!','И тишина...','А вот раньше просто кляпом рот затыкали.','Одна из ступеней развития слова - молчание.','Помолчи, за умного сойдешь.','Прям как рыбка теперь, только рот открывается.');

//молчанка на форуме
$comment_array_4 = array ('Флуд есть зло!','Тебе повезло, что не навсегда','Согласные с приговором - могут опустить руки и отойти от стенки','Неграмотные могут поставить крестик вместо подписи','Отмодерили? Расслабься и получай удовольствие','А может того... сразу в хаос?','Иди и напиши 5000 раз: &quot;Я больше не буду флудить на форуме&quot;','А будешь еще флудить на форуме - несчастный случай приключится... или авария какая...','Повышаем, повышаем уровень грамотности');

//блок
$comment_array_5 = array ('Вот такая трагическая и нелепая смерть.','Теперь понятно, куда использовать мой старый венок','Да и боец из него не очень… был…','Все мы там будем','На кладбище новоселье...','В его доме будет играть музыка, но он ее не услышит','Мы провожаем в последний путь... Мы провожаем... Черт, забыл, как там дальше. Аминь, короче.','Падай, ты убит!','&quot;Нет человека, нет проблем&quot;. Иосиф Виссарионович Паладинов.','Он был плохим солдатом','Кому тесно в рамках закона, будет нежиться в просторном гробу!','Вот так. Правду говорят, что словом убить можно.','Он не любил бойцовский клуб','Несчастные случаи и здесь бывают','Надеюсь, он успел написать завещание','В аду жарко, возьми с собой предмет: &quot;Огнетушитель раскаяния&quot;. Так... на память о Клубе.','Жестокий мир, жестокие сердца','Трупы ходят по БК, их видать издалека!','Вот теперь на кого-то наденут деревянный макинтош','Хаос был бы для него раем...','И разложится его труп на нолики и единички, а затем съедят их черви, вирусы и трояны.');

//хаос
$comment_array_6 = array ('Теперь твои глазки голубыми не назовешь.','С вещами на выход.','Законы надо соблюдать, клеймо рогатое!','Тот, кто попирает закон ногами, не может прочно стоять на них.','Ай-яй-яй, какие люди среди нас!','Мне б жену туда же','Присвойте ему номер, а то там такая неразбериха.','А жену мою отправь?!','С утра ждал этого момента','Мда…. Надеюсь это не смертельно.','Ходят тут всякие, а потом вещи пропадают.','Хвала Мироздателю!');

//вампир
$comment_array_7 = array ('Я называл это пох#измом когда тебя кусает вампир и ты не реагируешь на это, пока не узнал слово &quot;стрессоустойчивость&quot;.','Покупайте чеснок!','Теперь на кровь остальные сбегутся.','Ню-ню, а я осиновый кол точу','Примочки святой водой три раза в день и все пройдет.','По-моему, жена у меня тоже такая :(','А вы думали, что это просто летучие мыши?','Готовьте люди колья!','Ну, прям по расписанию, а я думал уже не укусит.','Это попахивает чем-то потусторонним.','И ничто не предвещало беды.','Я всегда говорил, мой любимый - чесночный суп :)','Тьма наступает!','Никогда к этому не привыкну.','А ведь предупреждали, садись на пенек, ешь пирожок с чесноком :)','Развелось, тут всякой нечисти...','Да что же это делается???','Второй раз будет не так больно.','Кровососы...','Сегодня же полнолуние, вы что, забыли ???','Интересно, а теперь он тоже станет вампиром???','Чеснок - не только при простуде.','Это ж надо такому случится.','Озверели совсем - на людей кидаются...Не дай бог так оголодать....','Ой, а мне бабушка тоже о вампирах рассказывала');

//рандом молчанок, хаосов, блоков
$comment_sleep = $comment_array_3[mt_rand(0,count($comment_array_3)-1)];
$comment_fsleep = $comment_array_4[mt_rand(0,count($comment_array_4)-1)];
$comment_death = $comment_array_5[mt_rand(0,count($comment_array_5)-1)];
$comment_haos = $comment_array_6[mt_rand(0,count($comment_array_6)-1)];
$comment_vampir = $comment_array_7[mt_rand(0,count($comment_array_7)-1)];

//рандом sex
if($u->info['sex'] == 0) {
$comment = $comment_array_1[mt_rand(0,count($comment_array_1)-1)];
} else {
$comment = $comment_array_2[mt_rand(0,count($comment_array_2)-1)];
}

/* Общение */
$txt = '';
if(isset($_POST['text']))
{
$txt = $_POST['text'];
}
if(strpos($txt,'привет') || strpos($txt,'здравствуй') || strpos($txt,'хай') || strpos($txt,'hi') || strpos($txt,'privet') || strpos($txt,'Привет') || strpos($txt,'Здравствуй') || strpos($txt,'Хай') || strpos($txt,'Hi') || strpos($txt,'Privet'))
{
  $mntxt = array(0=>'Здравствуй',1=>'Привет',2=>'Привет, не ждал что напишешь так');
  $comment = $mntxt[rand(0,2)];
}

if(strpos($txt,'здаров') || strpos($txt,'Здаров'))
{
  $mntxt = array(0=>'Здоровей видали!',1=>'Ну, здравствуй, друг сердечный',2=>'Ты вообще кто?');
  $comment = $mntxt[rand(0,2)];
}


?>