<?php
if(!defined('GAME'))
{
	die();
}

session_start();

function js_help($txt,$color = 'Black')
{
	global $r;
	$r['js'] .= 'chat.sendMsg(["new","'.time().'","6","","'.$u->info['login'].'","<small>'.$txt.'</small>","'.$color.'","1","1","0"]);';
}

if(!isset($_SESSION['help_step']) || $_SESSION['help_step'] < 1)
{
	$_SESSION['help_step'] = 1;
}

//Редиректы
$go_help = array(
	1 => array(
			1 => 2,
			2 => 3
	),
	2 => array( 0 => 1 ),
	3 => array( 0 => 1 , 1 => 3 )
);

if($chat->str_count($_POST['msg'],2)=='/[')
{
	$_POST['msg'] = str_replace('/[','',$_POST['msg']);
	$_POST['msg'] = str_replace(']','',$_POST['msg']);
	$_POST['msg'] = round((int)$_POST['msg']);
	if(isset($go_help[$_SESSION['help_step']][$_POST['msg']]))
	{
		$_SESSION['help_step'] = $go_help[$_SESSION['help_step']][$_POST['msg']];
	}else{
		js_help('----------------------------------------------------------------------------------------');
		js_help('<b><font color=red>Ошибка, раздел справки не найден</font></b>');	
	}
}

//js_help('----------------------------------------------------------------------------------------');
if($chat->str_count($_POST['msg'],5)=='/help' || $_SESSION['help_step']==1)
{	
	js_help('<b>Добро пожаловать в раздел справки!</b>');
	js_help('Вырерите раздел справки: <i>(Отправить ответ в чат. Пример: &quot;/[1]&quot;)</i>');
	js_help('[1] Информация о пользовании чатом');
	js_help('[2] Нагрузка сервера');
	js_help('[0] Закрыть справку');	
}elseif($_SESSION['help_step']==2)
{	
	js_help('<b>Раздел:</b> Информация о пользовании чатом');
	js_help('<b>Чат</b> - выглядит как обычная веб-страница, где можно прочесть последние несколько десятков фраз, написанные участниками чата и модераторами. Страница чата автоматически обновляется с заданной периодичностью. Участники чата которые нарушили правила общения могут получают молчанку и не могут общаться определенное время. Для более подробной информации выберите следующий раздел.');
	js_help('Вырерите раздел справки: <i>(Отправить ответ в чат. Пример: &quot;/[1]&quot;)</i>');
	js_help('[0] Вернуться назад');	
}elseif($_SESSION['help_step']==3)
{	
	$load = sys_getloadavg();
	js_help('<b>Нагрузка:</b> '.$load[0].' / '.$load[1].' / '.$load[2]);
	js_help('[1] Обновить');
	js_help('[0] Вернуться назад');	
}
js_help('----------------------------------------------------------------------------------------');
?>