<?php

$log_text    = array();
$log_text[0] = array(); //для муж.
//R1
$log_text[0][1][0] = 'вспомнил что-то важное';
$log_text[0][1][1] = 'высморкался';
$log_text[0][1][2] = 'задумался';
$log_text[0][1][3] = 'замешкался';
$log_text[0][1][4] = 'засмотрелся на <вырезано цензурой>';
$log_text[0][1][5] = 'кашлянул';
$log_text[0][1][6] = 'ковырялся в зубах';
$log_text[0][1][7] = 'обернулся';
$log_text[0][1][8] = 'осмотрелся';
$log_text[0][1][9] = 'почесался';
$log_text[0][1][10] = 'пошатнулся';
$log_text[0][1][11] = 'пришел в себя';
$log_text[0][1][12] = 'пытался сконцентрироваться';
$log_text[0][1][13] = 'пытался увернуться';
$log_text[0][1][14] = 'пытался что-то сказать';
$log_text[0][1][15] = 'расплылся в улыбке';
$log_text[0][1][16] = 'расстроился';
$log_text[0][1][17] = 'растерялся';
$log_text[0][1][18] = 'удивился';
$log_text[0][1][19] = 'чесал <вырезано цензурой>';
$log_text[0][1][20] = 'пытался отойти покурить';
$log_text[0][1][21] = 'чесал яйца';

//R2
$log_text[0][2][0] = ', и за это ';
$log_text[0][2][1] = ', а ';
$log_text[0][2][2] = ', но в это время ';
$log_text[0][2][3] = ', и тут ';
$log_text[0][2][4] = ', но вдруг неожиданно ';
$log_text[0][2][5] = ', и вдруг ';
$log_text[0][2][6] = ', но ';
$log_text[0][2][7] = ', и внезапно ';
$log_text[0][2][8] = ', но неожиданно ';
$log_text[0][2][9] = ', и в этот момент ';
$log_text[0][2][10] = ', и в ту же секунду ';
$log_text[0][2][11] = ', и в этот миг ';

//R3
$log_text[0][3][0] = 'обезумевший';
$log_text[0][3][1] = 'расстроенный';
$log_text[0][3][2] = 'неустрашимый';
$log_text[0][3][3] = 'продвинутый';
$log_text[0][3][4] = 'расстроенный';
$log_text[0][3][5] = 'страшный';
$log_text[0][3][6] = 'задумчивый';
$log_text[0][3][7] = 'небритый';
$log_text[0][3][8] = 'бесстрастный';
$log_text[0][3][9] = 'разъяренный';
$log_text[0][3][10] = 'смелый';
$log_text[0][3][11] = 'безумный';
$log_text[0][3][12] = 'восхитительный';
$log_text[0][3][13] = 'жестокий';
$log_text[0][3][14] = 'злобный';
$log_text[0][3][15] = 'мужественный';
$log_text[0][3][16] = 'непобедимый';
$log_text[0][3][17] = 'наглый';
$log_text[0][3][18] = 'хитрый';
$log_text[0][3][19] = 'храбрый';
$log_text[0][3][20] = 'отважный';
$log_text[0][3][21] = 'железный';
$log_text[0][3][22] = 'могучий';
$log_text[0][3][23] = 'сильнейший';
$log_text[0][3][24] = 'крепкий';
$log_text[0][3][25] = 'великий';
$log_text[0][3][26] = 'бесстрашный';


//R4
$log_text[0][4][0] = 'случайно ';
$log_text[0][4][1] = 'отчаянно ';
$log_text[0][4][2] = 'проснувшись ';
$log_text[0][4][3] = 'мимоходом ';
$log_text[0][4][4] = 'разбежавшись ';
$log_text[0][4][5] = 'сдуру ';
$log_text[0][4][6] = 'со скуки ';
$log_text[0][4][7] = 'не помня себя от испуга ';
$log_text[0][4][8] = 'улыбаясь ';
$log_text[0][4][9] = 'прослезившись ';
$log_text[0][4][10] = 'пошатнувшись ';
$log_text[0][4][11] = 'проснувшись ';
$log_text[0][4][12] = 'беспричинно ';
$log_text[0][4][13] = 'опрометчиво ';
$log_text[0][4][14] = 'разбежавшись ';
$log_text[0][4][15] = 'зевнув ';
$log_text[0][4][16] = 'сделав двойное сальто ';
$log_text[0][4][17] = 'не подумав ';
$log_text[0][4][18] = 'хихикая ';
$log_text[0][4][19] = 'ласково ';
$log_text[0][4][20] = 'с испугу ';

//R5
$log_text[0][5][0] = 'влепил ';
$log_text[0][5][1] = 'вломил ';
$log_text[0][5][2] = 'саданул ';

//R6
$log_text[0][6][0] = 'грубый';
$log_text[0][6][1] = 'наглый';
$log_text[0][6][2] = 'красивый';

//R7
$log_text[0][7][0] = 'неизвестный удар';
$log_text[0][7][1] = 'колющий удар';
$log_text[0][7][2] = 'рубящий удар';
$log_text[0][7][3] = 'дробящий удар';
$log_text[0][7][4] = 'режущий удар';
$log_text[0][7][5] = 'обжигающий удар';
$log_text[0][7][6] = 'удар электричеством';
$log_text[0][7][7] = 'обмораживающий удар';
$log_text[0][7][8] = 'удар магией земли';
$log_text[0][7][9] = 'удар светлой магией';
$log_text[0][7][10] = 'удар тёмной магией';
$log_text[0][7][11] = 'удар серой магией';
$log_text[0][7][12] = 'обычный удар';
$log_text[0][7][13] = 'удар';

//R8
$log_text[0][8][0] = 'не контролировал ситуацию';
$log_text[0][8][1] = 'обманулся';
$log_text[0][8][2] = 'старался провести удар';
$log_text[0][8][3] = 'думал о <вырезано цензурой>';
$log_text[0][8][4] = 'испугался';
$log_text[0][8][5] = 'потерял самоконтроль';
$log_text[0][8][6] = 'потерял момент';
$log_text[0][8][7] = 'был слишком самоуверен';
$log_text[0][8][8] = 'пытался провести удар';
$log_text[0][8][9] = 'поскользнулся';
$log_text[0][8][10] = 'не думал о бое';
$log_text[0][8][11] = 'не рассчитал свои силы';
$log_text[0][8][12] = 'промахнулся';
$log_text[0][8][13] = 'оступился';
$log_text[0][8][14] = 'думал не о том';

//R9
$log_text[0][9][0] = ', и потому ';
$log_text[0][9][1] = ' и ';
$log_text[0][9][2] = ', но ';
$log_text[0][9][3] = ', вследствие чего ';
$log_text[0][9][4] = ', потому ';

//R10
$log_text[0][10][0] = 'остановил';
$log_text[0][10][1] = 'поставил блок на';
$log_text[0][10][2] = 'блокировал';
$log_text[0][10][3] = 'отбил';

//R11
$log_text[0][11][0] = 'ушел вправо от удара';
$log_text[0][11][1] = 'ушел влево от удара';
$log_text[0][11][2] = 'увел удар';
$log_text[0][11][3] = 'уклонился от удара';
$log_text[0][11][4] = 'увернулся от удара';

//R12
$log_text[0][12][0] = 'приняв боевые 100 грамм';
$log_text[0][12][1] = 'сказав &quot;БУ!&quot;';
$log_text[0][12][2] = 'показав противнику кукиш';
$log_text[0][12][3] = 'в отчаянном рывке';
$log_text[0][12][4] = 'показав сразу два пальца';

//R13
$log_text[0][13][0] = 'о<вырезано цензурой>ный';
$log_text[0][13][1] = 'точнейший';

//R14
$log_text[0][14][0] = 'погиб!';
$log_text[0][14][1] = 'повержен!';
$log_text[0][14][2] = 'мертв!';
$log_text[0][14][3] = 'убит!';
$log_text[0][14][4] = 'проиграл бой!';

$log_text[1] = array(); //для жен.
//R1
$log_text[1][1][0] = 'вспомнила что-то важное';
$log_text[1][1][1] = 'высморкалась';
$log_text[1][1][2] = 'задумалась';
$log_text[1][1][3] = 'замешкалась';
$log_text[1][1][4] = 'засмотрелась на <вырезано цензурой>';
$log_text[1][1][5] = 'кашлянула';
$log_text[1][1][6] = 'ковырялась в зубах';
$log_text[1][1][7] = 'обернулась';
$log_text[1][1][8] = 'осмотрелась';
$log_text[1][1][9] = 'почесалась';
$log_text[1][1][10] = 'пошатнулась';
$log_text[1][1][11] = 'пришла в себя';
$log_text[1][1][12] = 'пыталась сконцентрироваться';
$log_text[1][1][13] = 'пыталась увернуться';
$log_text[1][1][14] = 'пыталась что-то сказать';
$log_text[1][1][15] = 'расплылалась в улыбке';
$log_text[1][1][16] = 'расстроилась';
$log_text[1][1][17] = 'растерялась';
$log_text[1][1][18] = 'удивилась';
$log_text[1][1][19] = 'чесала <вырезано цензурой>';
$log_text[1][1][20] = 'пыталась отойти покурить';
$log_text[1][1][21] = 'поправляла прическу';

//R2
$log_text[1][2][0] = ', и за это ';
$log_text[1][2][1] = ', а ';
$log_text[1][2][2] = ', но в это время ';
$log_text[1][2][3] = ', и тут ';
$log_text[1][2][4] = ', но вдруг неожиданно ';
$log_text[1][2][5] = ', и вдруг ';
$log_text[1][2][6] = ', но ';
$log_text[1][2][7] = ', и внезапно ';
$log_text[1][2][8] = ', но неожиданно ';
$log_text[1][2][9] = ', и в этот момент ';
$log_text[1][2][10] = ', и в ту же секунду ';
$log_text[1][2][11] = ', и в этот миг ';

//R3
$log_text[1][3][0] = 'обезумевшая';
$log_text[1][3][1] = 'расстроенная';
$log_text[1][3][2] = 'неустрашимая';
$log_text[1][3][3] = 'продвинутая';
$log_text[1][3][4] = 'расстроенная';
$log_text[1][3][5] = 'страшная';
$log_text[1][3][6] = 'задумчивая';
$log_text[1][3][7] = 'взъерошенная';
$log_text[1][3][8] = 'бесстрастная';
$log_text[1][3][9] = 'разъяренная';
$log_text[1][3][10] = 'смелая';
$log_text[1][3][11] = 'безумная';
$log_text[1][3][12] = 'восхитительная';
$log_text[1][3][13] = 'жестокая';
$log_text[1][3][14] = 'злобная';
$log_text[1][3][15] = 'мужественная';
$log_text[1][3][16] = 'непобедимая';
$log_text[1][3][17] = 'наглая';
$log_text[1][3][18] = 'хитрая';
$log_text[1][3][19] = 'храбрая';
$log_text[1][3][20] = 'отважная';
$log_text[1][3][21] = 'железная';
$log_text[1][3][22] = 'могучая';
$log_text[1][3][23] = 'сильнейшая';
$log_text[1][3][24] = 'крепкая';
$log_text[1][3][25] = 'великая';
$log_text[1][3][26] = 'бесстрашная';


//R4
$log_text[1][4][0] = 'случайно ';
$log_text[1][4][1] = 'отчаянно ';
$log_text[1][4][2] = 'проснувшись ';
$log_text[1][4][3] = 'мимоходом ';
$log_text[1][4][4] = 'разбежавшись ';
$log_text[1][4][5] = 'сдуру ';
$log_text[1][4][6] = 'со скуки ';
$log_text[1][4][7] = 'не помня себя от испуга ';
$log_text[1][4][8] = 'улыбаясь ';
$log_text[1][4][9] = 'прослезившись ';
$log_text[1][4][10] = 'пошатнувшись ';
$log_text[1][4][11] = 'проснувшись ';
$log_text[1][4][12] = 'беспричинно ';
$log_text[1][4][13] = 'опрометчиво ';
$log_text[1][4][14] = 'разбежавшись ';
$log_text[1][4][15] = 'зевнув ';
$log_text[1][4][16] = 'сделав двойное сальто ';
$log_text[1][4][17] = 'не подумав ';
$log_text[1][4][18] = 'хихикая ';
$log_text[1][4][19] = 'ласково ';
$log_text[1][4][20] = 'с испугу ';

//R5
$log_text[1][5][0] = 'влепила ';
$log_text[1][5][1] = 'вломила ';
$log_text[1][5][2] = 'саданула ';

//R6
$log_text[1][6][0] = 'грубый';
$log_text[1][6][1] = 'наглый';
$log_text[1][6][2] = 'красивый';

//R7
$log_text[1][7][0] = 'тычок';
$log_text[1][7][1] = 'рубящий удар';
$log_text[1][7][2] = 'разбивающий удар';
$log_text[1][7][3] = 'рассекающий удар';
$log_text[1][7][4] = 'обжигающий удар';
$log_text[1][7][5] = 'удар электричеством';
$log_text[1][7][6] = 'обмораживающий удар';
$log_text[1][7][7] = 'удар магией земли';
$log_text[1][7][8] = 'удар светлой магией';
$log_text[1][7][9] = 'удар тёмной магией';
$log_text[1][7][10] = 'удар серой магией';
$log_text[1][7][11] = 'неизсветный удар';
$log_text[1][7][12] = 'удар';

//R8
$log_text[1][8][0] = 'не контролировала ситуацию';
$log_text[1][8][1] = 'обманулась';
$log_text[1][8][2] = 'старалась провести удар';
$log_text[1][8][3] = 'думала о <вырезано цензурой>';
$log_text[1][8][4] = 'испугалась';
$log_text[1][8][5] = 'потеряла самоконтроль';
$log_text[1][8][6] = 'потеряла момент';
$log_text[1][8][7] = 'была слишком самоуверенна';
$log_text[1][8][8] = 'пыталась провести удар';
$log_text[1][8][9] = 'поскользнулась';
$log_text[1][8][10] = 'не думала о бое';
$log_text[1][8][11] = 'не рассчитала свои силы';
$log_text[1][8][12] = 'промахнулась';
$log_text[1][8][13] = 'оступилась';
$log_text[1][8][14] = 'думала не о том';

//R9
$log_text[1][9][0] = ', и потому ';
$log_text[1][9][1] = ' и ';
$log_text[1][9][2] = ', но ';
$log_text[1][9][3] = ', вследствие чего ';
$log_text[1][9][4] = ', потому ';

//R10
$log_text[1][10][0] = 'остановила';
$log_text[1][10][1] = 'поставила блок на';
$log_text[1][10][2] = 'блокировала';
$log_text[1][10][3] = 'отбила';

//R11
$log_text[1][11][0] = 'ушла вправо от удара';
$log_text[1][11][1] = 'ушла влево от удара';
$log_text[1][11][2] = 'увела удар';
$log_text[1][11][3] = 'уклонилась от удара';
$log_text[1][11][4] = 'увернулась от удара';

//R12
$log_text[1][12][0] = 'приняв боевые 100 грамм';
$log_text[1][12][1] = 'сказав &quot;БУ!&quot;';
$log_text[1][12][2] = 'показав противнику кукиш';
$log_text[1][12][3] = 'в отчаянном рывке';
$log_text[1][12][4] = 'показав сразу два пальца';

//R13
$log_text[1][13][0] = 'о<вырезано цензурой>ный';
$log_text[1][13][1] = 'точнейший';

//R14
$log_text[1][14][0] = 'погибла!';
$log_text[1][14][1] = 'повержена!';
$log_text[1][14][2] = 'мертва!';
$log_text[1][14][3] = 'убита!';
$log_text[1][14][4] = 'проиграла бой!';

//R15
$log_text[0][15][0] = 'пропустил свой ход';
$log_text[1][15][0] = 'пропустила свой ход';
$log_text[0][15][1] = 'потратил свой ход на магию';
$log_text[1][15][1] = 'потратила свой ход на магию';
$log_text[0][15][2] = 'потратил свой ход на прием';
$log_text[1][15][2] = 'потратила свой ход на прием';







//Приемы / приемы
$log_text[0][16][0] = 'использовал';
$log_text[1][16][0] = 'использовала';

//Текст приемов (муж) (первый вариант)
$log_text[0][17][0] = '{u1}, вспомнив слова своего сэнсея, из последних сил применил прием &quot;{pr}&quot;.';
$log_text[0][17][1] = 'Кроличья лапка, подкова в перчатке и прием &quot;{pr}&quot; помогли {u1} продержаться ещё немного.';
$log_text[0][17][2] = '{u1}, пораскинув мозгами по земле, сообразил, что его выручат или прием &quot;{pr}&quot; или вмешательство Мусорщика.';
$log_text[0][17][3] = '{u1} выкрикнув: &quot;А ещё я вот так могу!&quot;, применил прием &quot;{pr}&quot;.';
$log_text[0][17][4] = '{u1} понял, пропустив очередной удар в голову, что поможет ему только прием &quot;{pr}&quot;.';
$log_text[0][17][5] = '{u1} сам не поняв зачем, применил прием &quot;{pr}&quot;.';
$log_text[0][17][6] = '{u1} нетрезво оценив положение, решил, что его спасение это прием &quot;{pr}&quot;.';

//Текст приемов (жен) (первый вариант)
$log_text[1][17][0] = '{u1}, вспомнив слова своего сэнсея, из последних сил применила прием &quot;{pr}&quot;.';
$log_text[1][17][1] = 'Кроличья лапка, подкова в перчатке и прием &quot;{pr}&quot; помогли {u1} продержаться ещё немного.';
$log_text[1][17][2] = '{u1}, пораскинув мозгами по земле, сообразила, что её выручат или прием &quot;{pr}&quot; или вмешательство Мусорщика.';
$log_text[1][17][3] = '{u1} выкрикнув: &quot;А ещё я вот так могу!&quot;, применила прием &quot;{pr}&quot;.';
$log_text[1][17][4] = '{u1} поняла, пропустив очередной удар в голову, что поможет ей только прием &quot;{pr}&quot;.';
$log_text[1][17][5] = '{u1} сама не поняв зачем, применила прием &quot;{pr}&quot;.';
$log_text[1][17][6] = '{u1} нетрезво оценив положение, решила, что её спасение это прием &quot;{pr}&quot;.';

//Текст приемов (муж) (второй вариант, на второго игрока)
$log_text[0][18][0] = '{u1}, вспомнив слова своего сэнсея, из последних сил применил прием &quot;{pr}&quot; на {u2}.';

//Текст приемов (жен) (второй вариант, на второго игрока)
$log_text[1][18][0] = '{u1}, вспомнив слова своего сэнсея, из последних сил применила прием &quot;{pr}&quot; на {u2}.';

//Текст приемов (муж) (магические) (урон)
$log_text[0][19][0]	= '{u1}, победив страх, решил поразить {u2} заклятьем &quot;{pr}&quot;';
$log_text[0][19][1]	= '{u1} наконец сфокусировал свое внимание на поединке и наколдовал &quot;{pr}&quot; на {u2}';
$log_text[0][19][2] = '{u1} нарисовав вокруг себя несколько рун, призвал заклятье &quot;{pr}&quot; на {u2}';
$log_text[0][19][3] = '{u1} догадавшись, что пришло время показать себя, произнес заклятье &quot;{pr}&quot; на {u2}';
$log_text[0][19][4] = '{u1} с испугу произнес, первое пришедшее на ум, заклятье &quot;{pr}&quot; на {u2}';
$log_text[0][19][5] = '{u1} впал в транс и начал бормотать заклятие &quot;{pr}&quot; на {u2}';
$log_text[0][19][6] = '{u1} очнулся от медитации, и призвал заклятье &quot;{pr}&quot; на {u2}';

//Текст промоха (муж) (магические)
$log_text[0][20][0] = '{u1} пытался наколдовать ужасающее заклятие &quot;{pr}&quot; на {u2}, но ничего не вышло';
$log_text[0][20][1] = '{u1} не смог сфокусировать и наколдовать &quot;{pr}&quot; на {u2}, но ничего не вышло';
$log_text[0][20][2] = '{u1} с испугу произнес ошибочное заклятие &quot;{pr}&quot; на {u2} и ничего не вышло';
$log_text[0][20][3] = '{u1}, потеряв концентрацию, не смог наколдовать &quot;{pr}&quot; на {u2} и ничего не вышло';
$log_text[0][20][4] = '{u1} <вырезано цензурой> от перенапряжения, вследствие чего не смог наколдовать &quot;{pr}&quot; на {u2}';
$log_text[0][20][5] = '{u1} пытался превратить {u2} в табуретку при помощи заклинания &quot;{pr}&quot;... но ничего не вышло';

//Текст приемов (муж) (магические) (на себя)
$log_text[0][21][0]	= '{u1}, победив страх, решил поразить всех и наколдовал &quot;{pr}&quot;';
$log_text[0][21][1]	= '{u1} наконец сфокусировал свое внимание на поединке и наколдовал &quot;{pr}&quot;';
$log_text[0][21][2] = '{u1} нарисовав вокруг себя несколько рун, призвал заклятье &quot;{pr}&quot;';
$log_text[0][21][3] = '{u1} догадавшись, что пришло время показать себя, произнес заклятье &quot;{pr}&quot;';
$log_text[0][21][4] = '{u1} с испугу произнес, первое пришедшее на ум, заклятье &quot;{pr}&quot;';
$log_text[0][21][5] = '{u1} впал в транс и начал бормотать заклятие &quot;{pr}&quot;';
$log_text[0][21][6] = '{u1} очнулся от медитации, и призвал заклятье &quot;{pr}&quot;';

//Текст приемов (жен) (магические) (урон)
$log_text[1][19][0]	= '{u1}, победив страх, решила поразить {u2} заклятьем &quot;{pr}&quot;';
$log_text[1][19][1]	= '{u1} наконец сфокусировала свое внимание на поединке и наколдовала &quot;{pr}&quot; на {u2}';
$log_text[1][19][2] = '{u1} нарисовав вокруг себя несколько рун, призвала заклятье &quot;{pr}&quot; на {u2}';
$log_text[1][19][3] = '{u1} догадавшись, что пришло время показать себя, произнесла заклятье &quot;{pr}&quot; на {u2}';
$log_text[1][19][4] = '{u1} с испугу произнесла, первое пришедшее на ум, заклятье &quot;{pr}&quot; на {u2}';
$log_text[1][19][5] = '{u1} впала в транс и начала бормотать заклятие &quot;{pr}&quot; на {u2}';
$log_text[1][19][6] = '{u1} очнулась от медитации, и призвала заклятье &quot;{pr}&quot; на {u2}';

//Текст промоха (жен) (магические)
$log_text[1][20][0] = '{u1} пыталась наколдовать ужасающее заклятие &quot;{pr}&quot; на {u2}, но ничего не вышло';
$log_text[1][20][1] = '{u1} не смогла сфокусировать и наколдовать &quot;{pr}&quot; на {u2}, но ничего не вышло';
$log_text[1][20][2] = '{u1} с испугу произнесла ошибочное заклятие &quot;{pr}&quot; на {u2} и ничего не вышло';
$log_text[1][20][3] = '{u1}, потеряв концентрацию, не смогла наколдовать &quot;{pr}&quot; на {u2} и ничего не вышло';
$log_text[1][20][4] = '{u1} <вырезано цензурой> от перенапряжения, вследствие чего не смогла наколдовать &quot;{pr}&quot; на {u2}';
$log_text[1][20][5] = '{u1} пыталась превратить {u2} в табуретку при помощи заклинания &quot;{pr}&quot;... но ничего не вышло';

//Текст приемов (жен) (магические) (на себя)
$log_text[1][21][0]	= '{u1}, победив страх, решила поразить всех и наколдовала &quot;{pr}&quot;';
$log_text[1][21][1]	= '{u1} наконец сфокусировала свое внимание на поединке и наколдовала &quot;{pr}&quot;';
$log_text[1][21][2] = '{u1} нарисовав вокруг себя несколько рун, призвала заклятье &quot;{pr}&quot;';
$log_text[1][21][3] = '{u1} догадавшись, что пришло время показать себя, произнесла заклятье &quot;{pr}&quot;';
$log_text[1][21][4] = '{u1} с испугу произнесла, первое пришедшее на ум, заклятье &quot;{pr}&quot;';
$log_text[1][21][5] = '{u1} впала в транс и начала бормотать заклятие &quot;{pr}&quot;';
$log_text[1][21][6] = '{u1} очнулась от медитации, и призвала заклятье &quot;{pr}&quot;';

?>